/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "ส่วนขยาย Telesec";
"06 06 02 82 06 01 0A 01"		= "กลไก Telesec";

"06 07 02 82 06 01 0A 01 00"	= "การรับรองความถูกต้องของ Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "การรับรองความถูกต้องของรหัสผ่าน";
"06 08 02 82 06 01 0A 01 00 02" = "การรับรองความถูกต้องของรหัสผ่านที่ป้องกันไว้";
"06 08 02 82 06 01 0A 01 00 03" = "การรับรองความถูกต้อง X.509 แบบทางเดียว";
"06 08 02 82 06 01 0A 01 00 04" = "การรับรองความถูกต้อง X.509 แบบสองทาง";
"06 08 02 82 06 01 0A 01 00 05" = "การรับรองความถูกต้อง X.509 แบบสามทาง";
"06 08 02 82 06 01 0A 01 00 06" = "การรับรองความถูกต้อง ISO9798 แบบทางเดียว";
"06 08 02 82 06 01 0A 01 00 07" = "การรับรองความถูกต้อง ISO9798 แบบสองทาง";
"06 08 02 82 06 01 0A 01 00 08" = "การรับรองความถูกต้องของ Telekom";

"06 07 02 82 06 01 0A 01 01"	= "ลายเซ็น Telesec ";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 ด้วย RSA และ ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 ด้วย RSA และ มาตรฐานลายเซ็น Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 ด้วย RSA และ ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 ด้วย RSA และ มาตรฐานลายเซ็น Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 ด้วย RSA และ มาตรฐานลายเซ็น Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "ลายเซ็น RSA ของ HBCI";

"06 07 02 82 06 01 0A 01 02"	= "การเข้ารหัส Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "ไม่มี";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "สีแดงม่วง";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "ฟังก์ชั่นทางเดียว";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "แฮชโดยใช้การเข้ารหัสบล็อก";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "ฟังก์ชั่น FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "โมดูล Telesec ";
"06 07 02 82 06 01 0A 02 00"	= "อัลกอริทึม";
"06 07 02 82 06 01 0A 02 01"	= "ประเภทคุณสมบัติ";
"06 07 02 82 06 01 0A 02 02"	= "ประเภทใบรับรอง";
"06 07 02 82 06 01 0A 02 03"	= "ประเภทข้อความ";
"06 07 02 82 06 01 0A 02 04"	= "โปรโตคอล PL";
"06 07 02 82 06 01 0A 02 05"	= "SME และส่วนประกอบของ SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "คำจำกัดความที่เป็นประโยชน์";
"06 07 02 82 06 01 0A 02 08"	= "ไฟล์ STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "การสั่งทางอิเล็กทรอนิกส์";
"06 07 02 82 06 01 0A 02 0B"	= "แอปพลิเคชั่นอสมมาตรสำหรับ TTP ของ Telesec";
"06 07 02 82 06 01 0A 02 0C"	= "แอปพลิเคชั่นพื้นฐานสำหรับ TTP ของ Telesec";
"06 07 02 82 06 01 0A 02 0D"	= "ข้อความ Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "แอปพลิเคชั่นประทับเวลาบันทึกสำหรับ TTP ของ Telesec";

"06 06 02 82 06 01 0A 03"		= "Object Class";
"06 07 02 82 06 01 0A 03 00"	= "ชื่ออื่นของ Telesec";
"06 07 02 82 06 01 0A 03 01"	= "ไดเร็กทอรี";
"06 07 02 82 06 01 0A 03 02"	= "ประเภทไดเร็กทอรี";
"06 07 02 82 06 01 0A 03 03"	= "กลุ่มไดเร็กทอรี";
"06 07 02 82 06 01 0A 03 04"	= "ผู้ใช้ไดเร็กทอรี";
"06 07 02 82 06 01 0A 03 05"	= "ข้อมูลเข้าของกุญแจสมมาตร";

"06 06 02 82 06 01 0A 04"		= "แพ็กเกจ";
"06 06 02 82 06 01 0A 05"		= "พารามิเตอร์";
"06 06 02 82 06 01 0A 06"		= "ความสัมพันธ์ของชื่อ";
"06 06 02 82 06 01 0A 07"		= "คุณสมบัติ";
"06 07 02 82 06 01 0A 07 00"	= "ตัวระบุกลุ่มแอปพลิเคชั่น";
"06 07 02 82 06 01 0A 07 01"	= "ประเภทใบรับรอง";
"06 07 02 82 06 01 0A 07 02"	= "ใบรับรอง Telesec";
"06 07 02 82 06 01 0A 07 03"	= "หมายเลขใบรับรอง";
"06 07 02 82 06 01 0A 07 04"	= "รายการเพิกถอนใบรับรอง";
"06 07 02 82 06 01 0A 07 05"	= "วันที่สร้าง";
"06 07 02 82 06 01 0A 07 06"	= "ผู้ออก";
"06 07 02 82 06 01 0A 07 07"	= "ผู้อนุมัติการตั้งชื่อ";
"06 07 02 82 06 01 0A 07 08"	= "ไดเร็กทอรีกุญแจสาธารณะ";
"06 07 02 82 06 01 0A 07 09"	= "โดเมนความปลอดภัย";
"06 07 02 82 06 01 0A 07 0A"	= "ชื่อเรื่อง";
"06 07 02 82 06 01 0A 07 0B"	= "เวลาเพิกถอน";
"06 07 02 82 06 01 0A 07 0C"	= "การอ้างอิงกลุ่มผู้ใช้";
"06 07 02 82 06 01 0A 07 0D"	= "ผลบังคับใช้";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "สภาพแวดล้อมของข้อความการรักษาความปลอดภัย";
"06 07 02 82 06 01 0A 07 10"	= "ไดเร็กทอรีกุญแจสาธารณะนิรนาม";
"06 07 02 82 06 01 0A 07 11"	= "ชื่อแรก Telesec";
"06 07 02 82 06 01 0A 07 12"	= "ส่วนเพิ่มเติมชื่อ";
"06 07 02 82 06 01 0A 07 13"	= "รหัสไปรษณีย์ Telesec";
"06 07 02 82 06 01 0A 07 14"	= "ตัวแยกความแตกต่างของชื่อ";
"06 07 02 82 06 01 0A 07 15"	= "รายการใบรับรอง Telesec";
"06 07 02 82 06 01 0A 07 16"	= "รายการใบรับรอง Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "รายการใบรับรอง X.509";
"06 07 02 82 06 01 0A 07 18"	= "เวลาออก";
"06 07 02 82 06 01 0A 07 19"	= "หมายเลขการ์ดจริง";
"06 07 02 82 06 01 0A 07 1A"	= "ประเภทไฟล์";
"06 07 02 82 06 01 0A 07 1B"	= "ไฟล์ Ctl เป็นไฟล์จัดเก็บ";
"06 07 02 82 06 01 0A 07 1C"	= "ที่อยู่อีเมล";
"06 07 02 82 06 01 0A 07 1D"	= "รายการแม่แบบใบรับรอง";
"06 07 02 82 06 01 0A 07 1E"	= "ชื่อไดเร็กทอรี";
"06 07 02 82 06 01 0A 07 1F"	= "ชื่อประเภทไดเร็กทอรี";
"06 07 02 82 06 01 0A 07 20"	= "ชื่อกลุ่มไดเร็กทอรี";
"06 07 02 82 06 01 0A 07 21"	= "ชื่อผู้ใช้ไดเร็กทอรี";
"06 07 02 82 06 01 0A 07 22"	= "ค่าสถานะการเพิกถอน";
"06 07 02 82 06 01 0A 07 23"	= "ชื่อข้อมูลเข้าของกุญแจสมมาตร";
"06 07 02 82 06 01 0A 07 24"	= "หมายเลข GL";
"06 07 02 82 06 01 0A 07 25"	= "หมายเลข GO";
"06 07 02 82 06 01 0A 07 26"	= "ข้อมูลกุญแจ G";
"06 07 02 82 06 01 0A 07 27"	= "ข้อมูลกุญแจ Z";
"06 07 02 82 06 01 0A 07 28"	= "ข้อมูลกุญแจ KT";
"06 07 02 82 06 01 0A 07 2A"	= "หมายเลขกุญแจ KT";
"06 07 02 82 06 01 0A 07 33"	= "เวลาสร้างการเพิกถอน";
"06 07 02 82 06 01 0A 07 34"	= "ข้อความระบุความรับผิด";

"06 06 02 82 06 01 0A 08"		= "กลุ่มคุณสมบัติ";
"06 06 02 82 06 01 0A 09"		= "การกระทำ";
"06 06 02 82 06 01 0A 0A"		= "การแจ้ง";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "แอปพลิเคชั่นความปลอดภัย";

"06 06 02 82 06 01 0A 0C"		= "ความหมายการขยายใบรับรองและ CRL";

"06 07 02 82 06 01 0A 0C 00"	= "ส่วนขยายการจำกัดความรับผิดชอบของการขยายใบรับรอง";
"06 07 02 82 06 01 0A 0C 01"	= "ส่วนขยายหมายเลขใบรับรอง Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "ตัวระบุนโยบาย Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID ตัวระบุนโยบาย Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "ส่วนขยาย Telesec CRL ที่ถูกกรอง";
"06 07 02 82 06 01 0A 0C 05"	= "ส่วนขยายตัวกรอง Telesec CRL";
"06 07 02 82 06 01 0A 0C 06"	= "ส่วนขยายผู้อนุมัติการตั้งชื่อ Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID ผู้ใช้";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "กล่องเมลแบบ RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "ส่วนประกอบของโดเมน";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "เบอร์โทรศัพท์ธุรกิจออสเตรเลีย";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "ตัวระบุนโยบายของออสเตรเลียสำหรับใบรับรอง";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet ส่วนบุคคล";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "ทางกฎหมายของ Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "ตัวระบุนโยบาย Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "อัลกอริทึมการเข้ารหัสแบบสมมาตร";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "ตัวระบุนโยบาย SEIS High-Assurance";
"06 06 2A 85 70 22 01 02"	= "ตัวระบุนโยบาย SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "ตัวระบุส่วนบุคคล SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "โมดูล ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "การจัดการใบรับรอง X9F1";
"06 06 2A 86 48 CE 38 02"		= "คำสั่งระงับ";
"06 07 2A 86 48 CE 38 02 01"	= "คำสั่งระงับ-ไม่มี";
"06 07 2A 86 48 CE 38 02 02"	= "ติดต่อผู้ออก";
"06 07 2A 86 48 CE 38 02 03"	= "ปฏิเสธ";
"06 07 2A 86 48 CE 38 02 04"	= "โทเค็น Pickup";
"06 06 2A 86 48 CE 38 03"		= "คุณสมบัติ";
"06 06 2A 86 48 CE 38 03 01"	= "Countersignature";
"06 06 2A 86 48 CE 38 03 02"	= "ใบรับรองคุณสมบัติ";
"06 06 2A 86 48 CE 38 04"		= "อัลกอริทึม";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA Match";
"06 07 2A 86 48 CE 38 04 03"	= "DSA ด้วย SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "ประเภท ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "ช่องหลัก";
"06 07 2A 86 48 CE 3D 01 02"	= "Characteristic-Two Field";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Characteristic-Two Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "หลักเกณฑ์ว่าง";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "หลักเกณฑ์ Trinomial";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanomial Basis";
"06 06 2A 86 48 CE 3D 02"		= "ประเภทกุญแจสาธารณะ";
"06 07 2A 86 48 CE 3D 02 01"	= "กุญแจสาธารณะ Elliptic Curve";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "ประเภท ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "ช่องหลักของ Galois";
"06 06 2A 86 48 CE 3E 02"		= "ประเภทหมายเลข";
"06 07 2A 86 48 CE 3E 02 01"	= "กุญแจสาธารณะ Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "แบบแผน";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman Static";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman Ephemeral";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "ข้อมูลเวอร์ชั่นความรับผิดชอบ";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE ด้วย MD5 และ CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC แบบใช้รหัสผ่าน";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "ผู้ใช้ความรับผิดชอบ";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "ข้อมูลความรับผิดชอบ CA";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "ใบรับรองคุณสมบัติ";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "การเข้ารหัส RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 กับการเข้ารหัส RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 กับการเข้ารหัส RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 กับการเข้ารหัส RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 ด้วยการเข้ารหัส RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "การเข้ารหัส RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "การเข้ารหัส RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "หัวข้อระบุ RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "แบบแผนลายเซ็น RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 ด้วยการเข้ารหัส RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 ด้วยการเข้ารหัส RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 ด้วยการเข้ารหัส RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 ด้วยการเข้ารหัส RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "การเข้ารหัส BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "ข้อตกลงกุญแจ Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE ด้วย MD2 และ DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE ด้วย MD5 และ DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE ด้วย MD2 และ RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE ด้วย MD5 และ RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE ด้วย MD5 และ XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE ด้วย SHA และ DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "ข้อมูล";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "ข้อมูลลงชื่อ";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "ข้อมูลปิดผนึก";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "ข้อมูลลงชื่อและปิดผนึก";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "ข้อมูลแยกย่อย";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "ข้อมูลเข้ารหัส";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "ข้อมูลกับคุณสมบัติ";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "ข้อมูลกุญแจส่วนตัวเข้ารหัส";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "ที่อยู่อีเมล";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "ชื่อไม่มีโครงสร้าง";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "ประเภทเนื้อหา";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "การแยกย่อยข้อความ";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "เวลาลงชื่อ";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Countersignature";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "สอบถามรหัสผ่าน";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "ที่อยู่ไม่มีโครงสร้าง";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "คุณสมบัติใบรับรองขยาย";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "ผู้ออกและหมายเลขประจำเครื่อง";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "การตรวจสอบรหัสผ่าน";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "กุญแจสาธารณะ";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "รายละเอียดการลงชื่อ";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "การขอส่วนขยาย";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "ความสามารถ S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "ต้องการข้อมูลลงชื่อ";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "ไม่สามารถถอดรหัสใดๆ";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "การขอใบเสร็จ";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "ใบเสร็จ";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "คำใบ้เนื้อหา";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "ประวัติการขยายรายการเมล";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "โมดูล S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "ไวยากรณ์ข้อความเข้ารหัส";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "บริการรักษาความปลอดภัยขั้นสูง";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "ตัวระบุวัตถุ S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "ข้อความ S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ลายเซ็นอิเล็กทรอนิกส์ ETS ปี 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ลายเซ็นอิเล็กทรอนิกส์ ETS ปี 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "นโยบายลายเซ็นอิเล็กทรอนิกส์ ETS ปี 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "นโยบายลายเซ็นอิเล็กทรอนิกส์ ETS ปี 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "ประเภทเนื้อหา S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-aa-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "คุณสมบัติ S/MIME ผ่านการรับรองความถูกต้อง";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "อัลกอริทึม S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "การกระจายใบรับรอง S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "การกระจายใบรับรอง LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "คุณสมบัติเหมาะสมของนโยบายลายเซ็น S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "ตัวระบุประเภทลายเซ็น S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "ลายเซ็นของผู้สร้าง";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "ลายเซ็นโดเมน";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "ลายเซ็นคุณสมบัติอื่นๆ";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "ตรวจทานลายเซ็น";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "ความสามารถ S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "ต้องการไบนารีภายใน";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "ชื่อจำง่าย (สำหรับ PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID ของกุญแจภายในเครื่อง (สำหรับ PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "ประเภทใบรับรอง (สำหรับ PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "ใบรับรอง X.509 (สำหรับ PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "ใบรับรอง SDSI (สำหรับ PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "ประเภท CRL (สำหรับ PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (สำหรับ PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "ไวยากรณ์การแลกเปลี่ยนข้อมูลส่วนบุคคล PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "ID การเข้ารหัสแบบใช้รหัสผ่าน PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE ด้วย SHA-1 และ RC4 แบบ 128 บิต";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE ด้วย SHA-1 และ RC4 แบบ 40 บิต";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE ด้วย SHA-1 และ 3-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE ด้วย SHA-1 และ 2-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE ด้วย SHA-1 และ RC2-CBC แบบ 128 บิต";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE ด้วย SHA-1 และ RC2-CBC แบบ 40 บิต";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "การห่อหุ้มกุญแจ PKCS-8 และ PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "ID ที่เก็บ PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "ID ที่เก็บกุญแจ PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "ใบรับรอง PKCS-12 และ ID ที่เก็บ CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID ที่เก็บลับของ PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID เนื้อหาปลอดภัยของ PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "ID ที่เก็บกุญแจการห่อหุ้ม PKCS-8 แบบ PKCS-12 ";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "ID ที่เก็บใบรับรอง PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "ใบรับรอง X.509 ของ PKCS-12 และ ID ที่เก็บ CRL";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "ID ที่เก็บใบรับรอง SDSI ของ PKCS-12";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "ID การเข้ารหัสแบบใช้รหัสผ่าน PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE ด้วย SHA-1 และ RC4 แบบ 128 บิต";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE ด้วย SHA-1 และ RC4 แบบ 40 บิต";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE ด้วย SHA-1 และ Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE ด้วย SHA-1 และ RC2-CBC แบบ 128 บิต";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE ด้วย SHA-1 และ RC2-CBC แบบ 40 บิต";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE ด้วย SHA-1 และ RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE ด้วย SHA-1 และ RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "ID การปิดผนึก PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "การเข้ารหัส RSA แบบ PKCS-12 ด้วย RC4 แบบ 128 บิต";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "การเข้ารหัส RSA แบบ PKCS-12 ด้วย RC4 แบบ 40 บิต";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "การเข้ารหัส RSA แบบ PKCS-12 ด้วย Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "ID ลายเซ็น PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "ลายเซ็น RSA แบบ PKCS-12 ด้วย SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 เวอร์ชั่น 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "ID ที่เก็บ PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "ที่เก็บกุญแจ PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "ที่เก็บกุญแจการห่อหุ้ม PKCS-8 แบบ PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "ที่เก็บใบรับรอง PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "ที่เก็บ CRL ของ PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "ที่เก็บลับของ PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "ที่เก็บเนื้อหาปลอดภัยของ PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "โมดูล PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "คุณสมบัติ PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "ประเภทเนื้อหา PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "เนื้อหา PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "อัลกอริทึมแยกย่อย RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC ด้วย SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "อัลกอริทึมการเข้ารหัส RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 ด้วย MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "ตัวระบุนโยบายไม่มีชื่อของ Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos v5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT User-to-User Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Microsoft Exchange Server object class";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Site-Addressing";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "แบบแผนคลาส";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "แบบแผนคุณสมบัติ";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "ตัวแทนกล่องเมล";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "กล่องเมล";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "ตัวบรรจุ";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "(ผู้รับเมล)";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "กลไกการส่ง";

"06 07 2A 86 48 86 F7 14 04"				= "รูปแบบไฟล์ Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "บริบทข้อมูลทางอ้อม SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "ข้อมูลตัวแทน SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "ประเภทคำสั่ง SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "ข้อมูล SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "ส่วนขยายใบรับรอง SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "ข้อมูลรูปภาพ SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "ลิงก์ SPC (ประเภท 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "การลงชื่อรหัสส่วนบุคคล";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "การลงชื่อรหัสเพื่อการค้า";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "ลิงก์ SPC (ประเภท 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "เกณฑ์ขั้นต่ำ SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "เกณฑ์การเงิน SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "ลิงก์ SPC (ประเภท 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "ผู้ให้บริการรับรองความปลอดภัย NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "ลายเซ็นกำกับการประทับเวลา";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "รายการใบรับรองเชื่อถือ";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "ส่วนขยาย CTL เรียงลำดับ";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "ตำแหน่งอัปเดตถัดไป";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "การใช้งานกุญแจส่วนขยาย";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "การลงชื่อรายการเชื่อถือใบรับรอง";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "การลงชื่อประทับเวลา";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "การเข้ารหัสแบบอนุกรม";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "ระบบไฟล์เข้ารหัส";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "การกู้ระบบไฟล์เข้ารหัส";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "เข้ากันได้กับฮาร์ดแวร์ของ Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "การลงชื่อ NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "การลงชื่อ OEM สำหรับฮาร์ดแวร์ของ Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "การลงชื่อแบบ Embedded NT";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "การลงชื่อรายการเชื่อถือได้หลัก";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "ตัวย่อยที่มีคุณสมบัติตามที่กำหนด";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "การกู้กุญแจ";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "การลงชื่อเอกสาร";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "ตัวระบุคุณสมบัติของวัตถุ";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "คุณสมบัติความเชื่อถือแบบเชื่อหรือไม่เชื่อ";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "การทำให้เป็นส่วนบุคคล Microsoft DRM";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "สิทธิ์การใช้งานของ Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "สิทธิ์การใช้งานของ Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "ตัวระบุวัตถุ PKCS-10 ของ Microsoft";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "ใบรับรองการต่อเวลา";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "คู่ของชื่อและค่าของการลงทะเบียน";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP การลงทะเบียน";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "เวอร์ชั่นของ OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange

";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "คุณสมบัติ PKCS-12 ของ Microsoft";
"06 09 2B 06 01 04 01 82 37 11 01"			= "ชุดกุญแจของเครื่องที่ใช้งานอยู่";

"06 08 2B 06 01 04 01 82 37 14"				= "โครงสร้างพื้นฐานการลงทะเบียนของ Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "การใช้งานการลงทะเบียน CTL อัตโนมัติ";
"06 09 2B 06 01 04 01 82 37 14 02"			= "ประเภทใบรับรองลงทะเบียน";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "ตัวแทนลงทะเบียน";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "การเข้าสู่ระบบด้วยสมาร์ทการ์ด";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "ชื่อหลัก NT";

"06 08 2B 06 01 04 01 82 37 15"				= "โครงสร้างพื้นฐานเซิร์ฟเวอร์ใบรับรองของ Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "เวอร์ชั่นต่อเวลาผู้อนุมัติ Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "เวอร์ชั่น CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "คุณสมบัติ CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "ชื่อเอกสาร";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "รายละเอียดเอกสาร";
"06 09 2B 06 01 04 01 82 37 58 03"			= "ข้อมูลเข้ารหัส";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "เนื้อหาเข้ารหัส";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "ตัวระบุนโยบาย UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "ตัวระบุนโยบาย ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "ตัวระบุนโยบาย CA ของ ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal ด้วย SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal ด้วย RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "คุณสมบัติ cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "การตรวจสอบการสภาพ cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP ตอบสนอง RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP ตอบสนอง RTCS แบบขยาย";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "เหตุผลการต่อ CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "คุณลักษณะกุญแจ";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "เนื้อหา cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "ข้อมูลการกำหนดค่า cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "ดัชนีผู้ใช้ cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "ข้อมูลผู้ใช้ cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "ตัวระบุนโยบาย XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "หลักฐานเวลา";
"06 08 2B 06 01 04 01 AA 60 01"		= "ระบบลายเซ็นเวลา";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "ระบบลายเซ็นเวลา 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "ระบบลายเซ็นเวลา 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "ระบบลายเซ็นเวลา 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "วิธีปฏิบัติรอง";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "รหัสประจำตัวแพทย์";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "ข้อมูลการรับรองความถูกต้องของ Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "ข้อมูลกุญแจ Kerberos Diffie-Hellman";
"06 07 2B 06 01 05 02 03 03"        = "ข้อมูลกุญแจตอบกลับ Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "การรับรองความถูกต้องของลูกข่าย Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "ศูนย์กระจายกุญแจ Kerberos (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "กลไกกุญแจสาธารณะแบบง่าย (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "โครงสร้างพื้นฐานกุญแจสาธารณะ";

"06 07 2B 06 01 05 05 07 01"		= "ส่วนขยายใบรับรองส่วนตัว PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "การเข้าถึงข้อมูลอนุมัติใบรับรอง";
"06 08 2B 06 01 05 05 07 01 02"		= "ข้อมูลชี้วัดทางชีวภาพ";
"06 08 2B 06 01 05 05 07 01 03"		= "การแสดงใบรับรองที่เข้าเกณฑ์";
"06 08 2B 06 01 05 05 07 01 04"		= "ข้อมูลประจำตัวตรวจคุณสมบัติของใบรับรอง";
"06 08 2B 06 01 05 05 07 01 05"		= "การตั้งเป้าหมายใบรับรองคุณสมบัติ";
"06 08 2B 06 01 05 05 07 01 06"		= "การควบคุมการอนุมัติใบรับรองคุณสมบัติ";
"06 08 2B 06 01 05 05 07 01 07"		= "บล็อกที่อยู่ IP ของ SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "ตัวระบุระบบอัตโนมัติ SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "ตัวระบุเราท์เตอร์ SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "การอนุมัติใบรับรองคุณสมบัติ";
"06 08 2B 06 01 05 05 07 01 0B"		= "การเข้าถึงข้อมูลเกี่ยวกับชื่อเรื่อง";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "ประเภทคุณสมบัติเหมาะสมของนโยบาย";
"06 08 2B 06 01 05 05 07 02 01"		= "คำชี้แจงวิธีปฏิบัติในการออกใบรับรอง";
"06 08 2B 06 01 05 05 07 02 02"		= "การแจ้งเตือนผู้ใช้";
"06 08 2B 06 01 05 05 07 02 03"		= "ข้อความประกาศ";

"06 07 2B 06 01 05 05 07 03"		= "วัตถุประสงค์กุญแจ";
"06 08 2B 06 01 05 05 07 03 01"		= "การรับรองความถูกต้องของเซิร์ฟเวอร์";
"06 08 2B 06 01 05 05 07 03 02"		= "การรับรองความถูกต้องของไคลเอนต์";
"06 08 2B 06 01 05 05 07 03 03"		= "การลงชื่อรหัส";
"06 08 2B 06 01 05 05 07 03 04"		= "การป้องกันอีเมล";
"06 08 2B 06 01 05 05 07 03 05"		= "ระบบปลายทาง IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "อุโมงค์ IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "ผู้ใช้ IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "การประทับเวลา";
"06 08 2B 06 01 05 05 07 03 09"		= "การลงชื่อ OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "การรับรองความถูกต้องของเซิร์ฟเวอร์ SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "ประเภทข้อมูล CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "ใบรับรองการเข้ารหัสโปรโตคอล CA";
"06 08 2B 06 01 05 05 07 04 02"		= "ประเภทคู่กุญแจการลงชื่อ";
"06 08 2B 06 01 05 05 07 04 03"		= "ประเภทคู่กุญแจเข้ารหัส";
"06 08 2B 06 01 05 05 07 04 04"		= "อัลกอริทึมสมมาตรที่ต้องการ";
"06 08 2B 06 01 05 05 07 04 05"		= "ข้อมูลอัปเดตกุญแจของ CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL ปัจจุบัน";
"06 08 2B 06 01 05 05 07 04 07"		= "OIDs ที่ไม่รองรับ";
"06 08 2B 06 01 05 05 07 04 08"		= "การขอสมัคร";
"06 08 2B 06 01 05 05 07 04 09"		= "การตอบกลับการสมัคร";
"06 08 2B 06 01 05 05 07 04 0A"		= "การขอพารามิเตอร์คู่กุญแจ";
"06 08 2B 06 01 05 05 07 04 0B"		= "การตอบกลับพารามิเตอร์คู่กุญแจ";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "การลงทะเบียน CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "การควบคุมการลงทะเบียน";
"06 09 2B 06 01 05 05 07 05 01 01"	= "โทเค็นการลงทะเบียน";
"06 09 2B 06 01 05 05 07 05 01 02"	= "ผู้รับรองความถูกต้อง";
"06 09 2B 06 01 05 05 07 05 01 03"	= "ข้อมูลการเผยแพร่ PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "ตัวเลือกการจัดเก็บ PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "ID ใบรับรองเก่า";
"06 09 2B 06 01 05 05 07 05 01 06"	= "กุญแจการเข้ารหัสโปรโตคอล";
"06 09 2B 06 01 05 05 07 05 01 07"	= "แม่แบบใบรับรองอีกแบบอื่น";
"06 09 2B 06 01 05 05 07 05 01 08"	= "แม่แบบ WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "ข้อมูลการลงทะเบียน CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "คู่ UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "การขอใบรับรอง";

"06 07 2B 06 01 05 05 07 06"		= "อัลกอริทึม";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "ไม่มีลายเซ็น";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "การควบคุม CMC";

"06 07 2B 06 01 05 05 07 08"		= "ชื่ออื่น";
"06 08 2B 06 01 05 05 07 08 01"		= "ข้อมูลส่วนบุคคล";
"06 08 2B 06 01 05 05 07 08 02"		= "กลุ่มผู้ใช้";

"06 07 2B 06 01 05 05 07 09"		= "ข้อมูลส่วนบุคคล";
"06 08 2B 06 01 05 05 07 09 01"		= "วันเกิด";
"06 08 2B 06 01 05 05 07 09 02"		= "สถานที่เกิด";
"06 08 2B 06 01 05 05 07 09 03"		= "ชื่อแฝง";
"06 08 2B 06 01 05 05 07 09 04"		= "เพศ";
"06 08 2B 06 01 05 05 07 09 05"		= "ประเทศที่ถือสัญชาติ";
"06 08 2B 06 01 05 05 07 09 06"		= "ประเทศที่พำนัก";

"06 07 2B 06 01 05 05 07 0A"		= "ใบรับรองคุณสมบัติ";
"06 08 2B 06 01 05 05 07 0A 01"		= "ข้อมูลการรับรองความถูกต้อง";
"06 08 2B 06 01 05 05 07 0A 02"		= "ข้อมูลประจำตัวการเข้าถึง";
"06 08 2B 06 01 05 05 07 0A 03"		= "ข้อมูลประจำตัวชำระเงิน";
"06 08 2B 06 01 05 05 07 0A 04"		= "กลุ่ม";
"06 08 2B 06 01 05 05 07 0A 05"		= "บทบาท";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "โปรโตคอลสำหรับสถานะใบรับรองออนไลน์";
"06 09 2B 06 01 05 05 07 30 01 01"	= "การตอบกลับพื้นฐาน OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "ส่วนขยาย Nonce ของ OCSP";
"06 09 2B 06 01 05 05 07 30 01 03"	= "การอ้างอิง CRL ของ OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "การตอบสนองของ OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP ไม่มีการตรวจสอบการเพิกถอน";
"06 09 2B 06 01 05 05 07 30 01 06"	= "การจำกัดการจัดเก็บ OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "ตัวค้นหาบริการ OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "ผู้ออก CA";
"06 08 2B 06 01 05 05 07 30 03"		= "การประทับเวลา";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE ชั่วคราว";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "อัลกอริทึมการเข้ารหัสแบบ DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "อัลกอริทึมแฮชแบบ DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "อัลกอริทึมลายเซ็น DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 ด้วย RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 ด้วย RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 ด้วย RSA";
"06 05 2B 0E 03 02 03"				= "MD5 ด้วย RSA";
"06 05 2B 0E 03 02 04"				= "MD4 กับการเข้ารหัส RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N ด้วย RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "ลายเซ็น RSA ";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA ด้วย SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 ด้วยลายเซ็น RSA";
"06 05 2B 0E 03 02 0F"				= "SHA ด้วยลายเซ็น RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman ด้วย Common Modulus";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Common";
"06 05 2B 0E 03 02 15"				= "DSA Common ด้วย SHA";
"06 05 2B 0E 03 02 16"				= "ถ่ายกุญแจ RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 ด้วยลายเซ็น RSA";
"06 05 2B 0E 03 02 19"				= "MD5 ด้วยลายเซ็น RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA ด้วย SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA ด้วย Common SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 ด้วยการเข้ารหัส RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 ด้วย RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 ด้วย ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "เอกสาร";
"06 04 2B 24 01 01"					= "เวอร์ชั่นสุดท้าย";
"06 04 2B 24 01 02"					= "แบบร่าง";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "อัลกอริทึม";
"06 04 2B 24 03 01"					= "อัลกอริทึมการเข้ารหัส";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "การเข้ารหัส RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "อัลกอริทึมแฮช";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "ความยาวหนึ่งเท่า MDC2";
"06 05 2B 24 03 02 05"				= "ความยาวสองเท่า MDC2";
"06 04 2B 24 03 03"					= "อัลกอริทึมลายเซ็น";
"06 05 2B 24 03 03 01"				= "ลายเซ็น RSA ";

"06 06 2B 24 03 03 01 01"			= "ลายเซ็น RSA ด้วย SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "ลายเซ็น RSA ด้วย SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "ลายเซ็น RSA ด้วย SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "ลายเซ็น RSA ด้วย SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "ลายเซ็น RSA ด้วย SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "ลายเซ็น RSA ด้วย SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "ลายเซ็น RSA ด้วย SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "ลายเซ็น RSA ด้วย SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "ลายเซ็น RSA ด้วย SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "ลายเซ็น RSA ด้วย SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "ลายเซ็น RSA ด้วย SHA-1 1024/L3

";
"06 09 2B 24 03 03 01 01 84 00 05"	= "ลายเซ็น RSA ด้วย SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "ลายเซ็น RSA ด้วย SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "ลายเซ็น RSA ด้วย SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "ลายเซ็น RSA ด้วย SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "ลายเซ็น RSA ด้วย SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "ลายเซ็น RSA ด้วย SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "ลายเซ็น RSA ด้วย SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "ลายเซ็น RSA ด้วย SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "ลายเซ็น RSA ด้วย SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "ลายเซ็น RSA ด้วย SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "ลายเซ็น RSA ด้วย SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "ลายเซ็น RSA ด้วย SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "ลายเซ็น RSA ด้วย SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "ลายเซ็น RSA ด้วย SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "ลายเซ็น RSA ด้วย SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "ลายเซ็น RSA ด้วย RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "ลายเซ็น RSA ด้วย RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "ลายเซ็น RSA ด้วย RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "ลายเซ็น RSA ด้วย RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "ลายเซ็น RSA ด้วย RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "ลายเซ็น RSA ด้วย RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "ลายเซ็น RSA ด้วย RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "ลายเซ็น RSA ด้วย RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "ลายเซ็น RSA ด้วย RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "ลายเซ็น RSA ด้วย RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "ลายเซ็น RSA ด้วย RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "ลายเซ็น RSA ด้วย RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "ลายเซ็น RSA ด้วย RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "ลายเซ็น RSA ด้วย RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "ลายเซ็น RSA ด้วย RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "ลายเซ็น RSA ด้วย RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "ลายเซ็น RSA ด้วย RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "ลายเซ็น RSA ด้วย RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "ลายเซ็น RSA ด้วย RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "ลายเซ็น RSA ด้วย RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "ลายเซ็น RSA ด้วย RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "ลายเซ็น RSA ด้วย RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "ลายเซ็น RSA ด้วย RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "ลายเซ็น RSA ด้วย RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "ลายเซ็น RSA ด้วย RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "ลายเซ็น RSA ด้วย RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "ลายเซ็น RSA ด้วย RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "ลายเซ็น RSA ด้วย RIPEMD-256";

"06 05 2B 24 03 03 02"				= "ลายเซ็น ECSIE";
"06 06 2B 24 03 03 02 01"			= "ลายเซ็น ECSIE ด้วย SHA-1";
"06 06 2B 24 03 03 02 02"			= "ลายเซ็น ECSIE ด้วย RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "ลายเซ็น ECSIE ด้วย MD2";
"06 06 2B 24 03 03 02 04"			= "ลายเซ็น ECSIE ด้วย MD5";

"06 04 2B 24 03 04"					= "แบบแผนลายเซ็น";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 ด้วย RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 ด้วย RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 ด้วย RND";

"06 03 2B 24 04"					= "คุณสมบัติ";
"06 03 2B 24 05"					= "นโยบาย";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API เฉพาะผู้ผลิต";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API เฉพาะฟังก์ชั่น";
"06 03 2B 24 07"					= "การจัดการกุญแจ";
"06 04 2B 24 07 01"					= "ข้อตกลงกุญแจ";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "โอนกุญแจ";
"06 05 2B 24 07 02 01"				= "ISO9796-2 ด้วยการเข้ารหัส RSA";

"06 05 2B 24 08 01 01"				= "ตัวระบุนโยบาย Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "บริการไดเร็กทอรี";

"06 05 2B 24 08 03 01"				= "วันที่สร้างใบรับรอง";
"06 05 2B 24 08 03 02"				= "การจัดหา";
"06 05 2B 24 08 03 03"				= "การสมัครเข้า";
"06 05 2B 24 08 03 04"				= "วงเงิน";
"06 05 2B 24 08 03 05"				= "การประกาศจากกลุ่มส่วนใหญ่";
"06 05 2B 24 08 03 06"				= "หมายเลขประจำการ์ดวงจรไอซี";
"06 05 2B 24 08 03 07"				= "อ้างอิงกุญแจสาธารณะ";
"06 05 2B 24 08 03 08"				= "การจำกัด";
"06 05 2B 24 08 03 09"				= "กู้ข้อมูลถ้าอนุญาต";
"06 05 2B 24 08 03 0A"				= "ใบรับรองที่ขอ";
"06 05 2B 24 08 03 0B"				= "ผู้อนุมัติการตั้งชื่อ";
"06 05 2B 24 08 03 0C"				= "ใบรับรองอยู่ในไดเร็กทอรีตั้งแต่";
"06 05 2B 24 08 03 0D"				= "ที่เก็บข้อมูลแบบแฮชของใบรับรอง";

"06 05 2B 24 08 04 01"				= "ข้อมูลส่วนบุคคล";
"06 05 2B 24 08 04 08"				= "การจำกัด";
"06 07 2B 24 08 05 01 01 01"		= "RSA ระบุ SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA ระบุ RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA ด้วย SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA ด้วย RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA Extended";
"06 07 2B 24 08 05 01 02 02"		= "DSA ด้วย RIPEMD-160";

"06 05 2B 24 08 06 01"				= "ใบรับรอง";
"06 05 2B 24 08 06 02"				= "การอ้างอิงใบรับรอง";
"06 05 2B 24 08 06 03"				= "ใบรับรองคุณสมบัติ";
"06 05 2B 24 08 06 04"				= "การอ้างอิงคุณสมบัติ";
"06 05 2B 24 08 06 05"				= "ชื่อไฟล์";
"06 05 2B 24 08 06 06"				= "เวลาการจัดเก็บ";
"06 05 2B 24 08 06 07"				= "ขนาดไฟล์";
"06 05 2B 24 08 06 08"				= "ที่ตั้ง";
"06 05 2B 24 08 06 09"				= "หมายเลขลายเซ็น";
"06 05 2B 24 08 06 0A"				= "ออกให้อัตโนมัติ";

"06 05 2B 24 08 07 01"				= "ประเภทการนำเสนอ Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "ไบนารี";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "ข้อความ";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "ส่วนขยายใบรับรอง Thawte";
"06 05 2B 65 01 04 01"				= "Extranet อย่างแข็งแรง";

/* X.520 */

"06 02 55 04"		= "ประเภทคุณสมบัติ X.520";
"06 03 55 04 00"	= "Object Class";
"06 03 55 04 01"	= "ชื่อป้อนเข้าอีกชื่อหนึ่ง";
"06 03 55 04 02"	= "ข้อมูลความรู้";
"06 03 55 04 03"	= "ชื่อทั่วไป";
"06 03 55 04 04"	= "นามสกุล";
"06 03 55 04 05"	= "หมายเลขประจำ";
"06 03 55 04 06"	= "ชื่อประเทศ";
"06 03 55 04 07"	= "ชื่อภายในท้องที่";
"06 04 55 04 07 01"	= "ชื่อภายในท้องที่รวบรวมเป็นกลุ่ม";
"06 03 55 04 08"	= "ชื่อรัฐหรือจังหวัด";
"06 04 55 04 08 01"	= "ชื่อรัฐหรือจังหวัดรวบรวมเป็นกลุ่ม";
"06 03 55 04 09"	= "บ้านเลขที่";
"06 04 55 04 09 01"	= "บ้านเลขที่รวบรวมเป็นกลุ่ม";
"06 03 55 04 0A"	= "ชื่อองค์กร";
"06 04 55 04 0A 01"	= "ชื่อองค์กรรวบรวมเป็นกลุ่ม";
"06 03 55 04 0B"	= "ชื่อหน่วยองค์กร";
"06 04 55 04 0B 01"	= "ชื่อหน่วยองค์กรรวบรวมเป็นกลุ่ม";
"06 03 55 04 0C"	= "เรื่อง";
"06 03 55 04 0D"	= "คำอธิบาย";
"06 03 55 04 0E"	= "การใช้การค้นหา";
"06 03 55 04 0F"	= "ประเภทธุรกิจ";
"06 03 55 04 10"	= "ที่อยู่ไปรษณีย์";
"06 04 55 04 10 01"	= "ที่อยู่ไปรษณีย์รวบรวมเป็นกลุ่ม";
"06 03 55 04 11"	= "รหัสไปรษณีย์";
"06 04 55 04 11 01"	= "รหัสไปรษณีย์รวบรวมเป็นกลุ่ม";
"06 03 55 04 12"	= "ตู้ไปรษณีย์";
"06 04 55 04 12 01"	= "ตู้ไปรษณีย์รวบรวมเป็นกลุ่ม";
"06 03 55 04 13"	= "ชื่อสำนักงานการขนส่งจริง";
"06 04 55 04 13 01"	= "ชื่อสำนักงานการขนส่งรวบรวมเป็นกลุ่ม";
"06 03 55 04 14"	= "เบอร์โทรศัพท์";
"06 04 55 04 14 01"	= "เบอร์โทรศัพท์รวบรวมเป็นกลุ่ม";
"06 03 55 04 15"	= "เบอร์โทรเลข";
"06 04 55 04 15 01"	= "เบอร์โทรเลขรวบรวมเป็นกลุ่ม";
"06 03 55 04 16"	= "ตัวระบุเทอร์มินัลโทรเลข";
"06 04 55 04 16 01"	= "ตัวระบุเทอร์มินัลโทรเลขรวบรวมเป็นกลุ่ม";
"06 03 55 04 17"	= "หมายเลขแฟกซ์";
"06 04 55 04 17 01"	= "หมายเลขโทรสารรวบรวมเป็นกลุ่ม";
"06 03 55 04 18"	= "ที่อยู่ X.121";
"06 03 55 04 19"	= "หมายเลข ISDN นานาชาติ";
"06 04 55 04 19 01"	= "หมายเลข ISDN นานาชาติรวบรวมเป็นกลุ่ม";
"06 03 55 04 1A"	= "ที่อยู่ลงทะเบียน";
"06 03 55 04 1B"	= "ตัวบ่งชี้ปลายทาง";
"06 03 55 04 1C"	= "วิธีการส่งที่ต้องการ";
"06 03 55 04 1D"	= "ที่อยู่การนำเสนอ";
"06 03 55 04 1E"	= "บริบทแอปพลิเคชั่นที่รองรับ";
"06 03 55 04 1F"	= "สมาชิก";
"06 03 55 04 20"	= "เจ้าของ";
"06 03 55 04 21"	= "ผู้ครอบครองบทบาท";
"06 03 55 04 22"	= "ดูเพิ่มเติม";
"06 03 55 04 23"	= "รหัสผ่านของผู้ใช้";
"06 03 55 04 24"	= "ใบรับรองผู้ใช้";
"06 03 55 04 25"	= "ใบรับรอง CA";
"06 03 55 04 26"	= "รายการเพิกถอนจากผู้อนุมัติ";
"06 03 55 04 27"	= "รายการเพิกถอนใบรับรอง";
"06 03 55 04 28"	= "คู่ใบรับรองไขว้";
"06 03 55 04 29"	= "ชื่อ";
"06 03 55 04 2A"	= "ชื่อแรก";
"06 03 55 04 2B"	= "ชื่อย่อ";
"06 03 55 04 2C"	= "คุณสมบัติเหมาะสมเพื่อการสร้าง";
"06 03 55 04 2D"	= "ตัวระบุไม่ซ้ำ";
"06 03 55 04 2E"	= "คุณสมบัติเหมาะสม DN";
"06 03 55 04 2F"	= "การใช้การค้นหาขั้นสูง";
"06 03 55 04 30"	= "ข้อมูลโปรโตคอล";
"06 03 55 04 31"	= "ชื่อที่แตกต่าง";
"06 03 55 04 32"	= "สมาชิกไม่ซ้ำ";
"06 03 55 04 33"	= "รหัสประจำบ้าน";
"06 03 55 04 34"	= "อัลกอริทึมที่รองรับ";
"06 03 55 04 35"	= "รายการเพิกถอนส่วนเปลี่ยนแปลง";
"06 03 55 04 36"	= "การล้างข้อมูล";
"06 03 55 04 3A"	= "คู่ใบรับรองไขว้";

/* X.500 object classes */

"06 02 55 06"		= "X.520 Object Class";
"06 03 55 06 00"	= "สูงสุด";
"06 03 55 06 01"	= "อีกชื่อหนึ่ง";
"06 03 55 06 02"	= "ประเทศ";
"06 03 55 06 03"	= "ภายในท้องที่";
"06 03 55 06 04"	= "องค์กร";
"06 03 55 06 05"	= "หน่วยองค์กร";
"06 03 55 06 06"	= "บุคคล";
"06 03 55 06 07"	= "บุคคลองค์กร";
"06 03 55 06 08"	= "บทบาทองค์กร";
"06 03 55 06 09"	= "กลุ่มชื่อ";
"06 03 55 06 0A"	= "บุคคลเกี่ยวกับที่พักอาศัย";
"06 03 55 06 0B"	= "โปรเซสของแอปพลิเคชั่น";
"06 03 55 06 0C"	= "เอนทิตี้ของแอปพลิเคชั่น";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "อุปกรณ์";
"06 03 55 06 0F"	= "ผู้ใช้การรับรองความถูกต้องอย่างมาก";
"06 03 55 06 10"	= "ผู้อนุมัติใบรับรอง";
"06 03 55 06 11"	= "กลุ่มชื่อไม่ซ้ำ";
"06 03 55 06 15"	= "ผู้ใช้ PKI ";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "อัลกอริทึม X.500";
"06 03 55 08 01"	= "อัลกอริทึมการเข้ารหัส X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "ส่วนขยายใบรับรอง X.509";
"06 03 55 1D 01"	= "ตัวระบุกุญแจผู้อนุมัติ (เก่า)";
"06 03 55 1D 02"	= "คุณสมบัติกุญแจหลัก (เก่า)";
"06 03 55 1D 03"	= "นโยบายใบรับรอง (เก่า)";
"06 03 55 1D 04"	= "ข้อจำกัดการใช้งานกุญแจ (เก่า)";
"06 03 55 1D 05"	= "ความสัมพันธ์นโยบาย (เก่า)";
"06 03 55 1D 06"	= "ข้อจำกัดของทรีย่อย";
"06 03 55 1D 07"	= "ชื่ออื่นของชื่อเรื่อง (เก่า)";
"06 03 55 1D 08"	= "ชื่ออื่นของผู้ออก (เก่า)";
"06 03 55 1D 09"	= "คุณสมบัติของรายการชื่อเรื่อง";
"06 03 55 1D 0A"	= "ข้อจำกัดพื้นฐาน (2.5.29.10 เก่า)";
"06 03 55 1D 0B"	= "ข้อจำกัดชื่อ (เก่า)";
"06 03 55 1D 0C"	= "ข้อจำกัดนโยบาย (เก่า)";
"06 03 55 1D 0D"	= "ข้อจำกัดพื้นฐาน (2.5.29.13 เก่า)";
"06 03 55 1D 0E"	= "ตัวระบุกุญแจชื่อเรื่อง";
"06 03 55 1D 0F"	= "การใช้งานกุญแจ";
"06 03 55 1D 10"	= "ระยะเวลาใช้กุญแจส่วนตัว";
"06 03 55 1D 11"	= "ชื่ออื่นของชื่อเรื่อง";
"06 03 55 1D 12"	= "ชื่ออื่นของผู้ออก";
"06 03 55 1D 13"	= "ข้อจำกัดพื้นฐาน";
"06 03 55 1D 14"	= "หมายเลขรายการเพิกถอนใบรับรอง";
"06 03 55 1D 15"	= "รหัสเหตุผล CRL";
"06 03 55 1D 16"	= "วันที่หมดอายุใช้ (เก่า)";
"06 03 55 1D 17"	= "รหัสคำสั่งระงับ";
"06 03 55 1D 18"	= "วันหมดการใช้";
"06 03 55 1D 19"	= "จุดกระจาย CRL (เก่า)";
"06 03 55 1D 1A"	= "จุดกระจายการออก (เก่า)";
"06 03 55 1D 1B"	= "ตัวระบุ Delta CRL";
"06 03 55 1D 1C"	= "จุดกระจายการออก";
"06 03 55 1D 1D"	= "ผู้ออกใบรับรอง";
"06 03 55 1D 1E"	= "ข้อจำกัดชื่อ";
"06 03 55 1D 1F"	= "จุดกระจาย CRL";
"06 03 55 1D 20"	= "นโยบายใบรับรอง";
"06 04 55 1D 20 00"	= "ตัวระบุนโยบายใดๆ";
"06 03 55 1D 21"	= "ความสัมพันธ์นโยบาย";
"06 03 55 1D 22"	= "ข้อจำกัดนโยบาย";
"06 03 55 1D 23"	= "ตัวระบุกุญแจผู้อนุมัติ";
"06 03 55 1D 24"	= "ข้อจำกัดนโยบาย";
"06 03 55 1D 25"	= "การใช้งานกุญแจส่วนขยาย";
"06 04 55 1D 25 00"	= "การใช้งานกุญแจส่วนขยายใดๆ";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "อัลกอริทึมลายเซ็น SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "อัลกอริทึมลายเซ็น Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "อัลกอริทึมการรักษาความลับ SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "อัลกอริทึมการรักษาความลับ Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "อัลกอริทึมความสมบูรณ์ SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "อัลกอริทึมความสมบูรณ์ของ Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "อัลกอริทึมการป้องกันแบบโทเค็น SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "อัลกอริทึมการป้องกันโทเค็น Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "อัลกอริทึมการจัดการกุญแจ SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "อัลกอริทึมการจัดการกุญแจ Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "การจัดการกุญแจ SDNS และอัลกอริทึมลายเซ็น";
"06 09 60 86 48 01 65 02 01 01 0C"	= "การจัดการกุญแจ Fortezza และอัลกอริทึมลายเซ็น";
"06 09 60 86 48 01 65 02 01 01 0D"	= "อัลกอริทึมลายเซ็น Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "อัลกอริทึมการรักษาความลับ Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "อัลกอริทึมความสมบูรณ์ Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "อัลกอริทึมการป้องกันแบบโทเค็น Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "อัลกอริทึมการจัดการกุญแจ Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "การจัดการกุญแจ Suite A และอัลกอริทึมลายเซ็น";
"06 09 60 86 48 01 65 02 01 01 13"	= "อัลกอริทึมแก้ไขลายเซ็น Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "การจัดการกุญแจ Fortezza และอัลกอริทึมแก้ไขลายเซ็น";
"06 09 60 86 48 01 65 02 01 01 15"	= "อัลกอริทึมอัปเดตความสมบูรณ์ของ Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "อัลกอริทึมแลกเปลี่ยนกุญแจ";
"06 09 60 86 48 01 65 02 01 01 17"	= "อัลกอริทึม Fortezza Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "อัลกอริทึมการเข้ารหัสกุญแจ (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "รูปแบบข้อความ RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "ไม่มีเนื้อหา";
"06 09 60 86 48 01 65 02 01 02 03"	= "ประเภทเนื้อหา CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "ประเภทเนื้อหา MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "ประเภทเนื้อหา MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "โปรโตคอลตัวแทน MSP Rekey";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "ประเภทเนื้อหา MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "ส่วนเนื้อหาข้อความ MSP ส่งต่อ";
"06 09 60 86 48 01 65 02 01 02 49"	= "พารามิเตอร์ข้อความส่งต่อ MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "ส่วนเนื้อหาข้อความ CSP ส่งต่อ";
"06 09 60 86 48 01 65 02 01 02 51"	= "พารามิเตอร์ข้อความส่งต่อ CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "นโยบายความปลอดภัย SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "นโยบายความปลอดภัย";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "ทั่วไป";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "นโยบายความปลอดภัยเริ่มต้น";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "ใบรับรองการจัดการกุญแจ SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "ใบรับรองลายเซ็น SDNS ของผู้ใช้";
"06 09 60 86 48 01 65 02 01 05 03"	= "การจัดการกุญแจ SDNS และใบรับรองลายเซ็น";
"06 09 60 86 48 01 65 02 01 05 04"	= "ใบรับรองการจัดการกุญแจ Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "การจัดการกุญแจ Fortezza และใบรับรองลายเซ็น";
"06 09 60 86 48 01 65 02 01 05 06"	= "ใบรับรองลายเซ็น Fortezza ของผู้ใช้";
"06 09 60 86 48 01 65 02 01 05 07"	= "ใบรับรองลายเซ็นผู้อนุมัติ Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "ใบรับรองลายเซ็น SDNS ของ CA";
"06 09 60 86 48 01 65 02 01 05 0A"	= "เว็กเตอร์เสริม";
"06 09 60 86 48 01 65 02 01 05 0B"	= "นโยบายใบเสร็จ";
"06 09 60 86 48 01 65 02 01 05 0C"	= "สมาชิกภาพ";
"06 09 60 86 48 01 65 02 01 05 0D"	= "ผู้ดูแลระบบ";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS Signature CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "ลายเซ็น SDNS แบบ CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "รายการเพิกถอนใบรับรอง SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "รายการเพิกถอนใบรับรอง Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "หน่วยประมวลผลส่วนที่อยู่ยกเว้น";
"06 09 60 86 48 01 65 02 01 05 30"	= "ป้องกัน";
"06 09 60 86 48 01 65 02 01 05 31"	= "รับรองอัลกอริทึม";
"06 09 60 86 48 01 65 02 01 05 32"	= "ใบรับรองการจัดการกุญแจ Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "การจัดการกุญแจ Suite A และใบรับรองลายเซ็น";
"06 09 60 86 48 01 65 02 01 05 34"	= "ใบรับรองลายเซ็น Suite A ของผู้ใช้";
"06 09 60 86 48 01 65 02 01 05 35"	= "ข้อมูล PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "ข้อจำกัด PRBAC ของ CA";
"06 09 60 86 48 01 65 02 01 05 37"	= "สิทธิ์พิเศษการจัดการกุญแจหรือลายเซ็น";
"06 09 60 86 48 01 65 02 01 05 38"	= "สิทธิพิเศษ Comm";
"06 09 60 86 48 01 65 02 01 05 39"	= "คุณสมบัติติดชื่ออยู่";
"06 09 60 86 48 01 65 02 01 05 3A"	= "ไฟล์ข้อมูลนโยบาย";
"06 09 60 86 48 01 65 02 01 05 3B"	= "ไฟล์ข้อมูลนโยบาย Sec";
"06 09 60 86 48 01 65 02 01 05 3C"	= "ข้อจำกัดการล้าง CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "ส่วนขยาย CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "ประเภทความปลอดภัย ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "สิทธิ์พิเศษป้ายชื่อความปลอดภัยมาตรฐาน";

"06 09 60 86 48 01 65 02 01 0A 01"			= "สิทธิ์พิเศษลายเซ็น";
"06 09 60 86 48 01 65 02 01 0A 02"			= "สิทธิ์พิเศษจัดการกุญแจ";
"06 09 60 86 48 01 65 02 01 0A 03"			= "สิทธิ์พิเศษชื่อชุดแท็ก";
"06 09 60 86 48 01 65 02 01 0B 01"			= "การสาธิตของ UK";
"06 09 60 86 48 01 65 02 01 0B 02"			= "US Department of Defense Class 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "US Department of Defense Class 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "US Department of Defense Class 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "US Department of Defense Class 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "US Department of Defense PKI Class 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "ทดสอบนโยบายความปลอดภัย";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "ประเภทความปลอดภัย TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "ชุดแท็กศูนย์ TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "ชุดแท็กหนึ่ง TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "ชุดแท็กสอง TSP2";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "ประเภทความปลอดภัย TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "ชุดแท็กศูนย์ TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "ชุดแท็กหนึ่ง TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "ชุดแท็กสอง TSP1";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "ประเภทความปลอดภัย Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "ชื่อชุดแท็ก Kafka 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "ชื่อชุดแท็ก Kafka 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "ชื่อชุดแท็ก Kafka 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "ทดสอบรายการ CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "หัวข้อ";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "ตัวระบุนโยบาย GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "ตัวระบุนโยบาย FBCA ขั้นต้น";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "ตัวระบุนโยบาย FBCA ขั้นพื้นฐาน";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "ตัวระบุนโยบาย FBCA ขั้นกลาง";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "ตัวระบุนโยบาย FBCA ขั้นสูง";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "กุญแจ KRA";
"06 08 60 86 48 01 65 03 02 03"			= "ส่วนขยาย";
"06 09 60 86 48 01 65 03 02 03 01"		= "เทคนิคกู้กุญแจ";
"06 09 60 86 48 01 65 03 02 03 02"		= "ความสามารถกู้กุญแจ";
"06 09 60 86 48 01 65 03 02 03 03"		= "การกู้กุญแจ";
"06 08 60 86 48 01 65 03 02 04"			= "แบบแผนกู้กุญแจ";
"06 08 60 86 48 01 65 03 02 05"			= "ส่วนขยาย CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "อัลกอริทึม NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "อัลกอริทึม Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 กับการเข้ารหัส RSA แบบ BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 กับการเข้ารหัส RSA แบบ BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 ด้วยการเข้ารหัส RSA แบบ BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM Digest";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC ด้วย SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC ด้วย MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4 Packet";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "BSAFE1 แบบการเข้ารหัส RSA";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "รหัสผ่าน NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "ประเภทคุณสมบัติของ PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "คุณสมบัติความปลอดภัย";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "ขีดจำกัดความไว้ใจ";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "ตัวระบุวัตถุ Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "ส่วนขยายใบรับรองของ Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "ประเภทใบรับรอง Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL ฐานของ Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL การเพิกถอนของ Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL การเพิกถอนผู้อนุมัติใบรับรอง Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL ดาวน์โหลด CRL ของ Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL ดาวน์โหลดใบรับรอง Netscape ของ CA";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL ต่อเวลาใบรับรอง Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL นโยบาย Netscape ของ CA";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL โฮมเพจสำหรับใบรับรอง Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "โลโก้เอ็นทิตี้ใบรับรอง Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "รูปภาพผู้ใช้ใบรับรอง Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "ชื่อเซิร์ฟเวอร์ SSL ของ Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "ข้อคิดเห็นใบรับรอง Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "ประเภทข้อมูล Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "รูปภาพ/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "รูปภาพ/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "ลำดับใบรับรอง Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL ใบรับรอง Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "ตัวระบุวัตถุไดเร็กทอรี Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "คำจำกัดความของ LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "ทะเบียนรถ";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "หมายเลขแผนก";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "หมายเลขพนักงาน";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "ประเภทพนักงาน";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "บุคคลในองค์กรของอินทราเน็ต";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "กล่องเมลเข้า Verisign";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "ส่วนขยาย VPN ของ Verisign ไม่มีชื่อ";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "ส่วนขยาย VPN ของ Verisign ไม่มีชื่อ";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "ตัวระบุนโยบาย Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "ประกาศของ Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "ประเภทเนื้อหา";
"06 04 67 2A 00 00"	= "ข้อมูล PAN";
"06 04 67 2A 00 01"	= "โทเค็น PAN";
"06 04 67 2A 00 02"	= "เฉพาะ PAN";

"06 03 67 2A 01"	= "ส่วนขยายข้อความ";
"06 03 67 2A 02"	= "ช่อง";
"06 04 67 2A 02 00"	= "ชื่อเต็ม";
"06 04 67 2A 02 01"	= "ชื่อแรก";
"06 04 67 2A 02 02"	= "ชื่อตระกูล";
"06 04 67 2A 02 03"	= "ชื่อตระกูลเกิด";
"06 04 67 2A 02 04"	= "ชื่อสถานที่";
"06 04 67 2A 02 05"	= "หมายเลขประจำตัว";
"06 04 67 2A 02 06"	= "เดือน";
"06 04 67 2A 02 07"	= "วันที่";
"06 04 67 2A 02 08"	= "ที่อยู่";
"06 04 67 2A 02 09"	= "โทรศัพท์";
"06 04 67 2A 02 0A"	= "จำนวน";
"06 04 67 2A 02 0B"	= "หมายเลขบัญชี";
"06 04 67 2A 02 0C"	= "วลีรหัสผ่าน";

"06 03 67 2A 03"		= "คุณสมบัติ";
"06 04 67 2A 03 00"		= "ใบรับรอง";
"06 05 67 2A 03 00 00"	= "รหัสประจำตัวกุญแจหลัก";
"06 05 67 2A 03 00 01"	= "นโยบายเพิ่มเติม";

"06 03 67 2A 04"	= "อัลกอริทึม";
"06 03 67 2A 05"	= "นโยบาย";
"06 04 67 2A 05 00"	= "หลัก";
"06 03 67 2A 06"	= "โมดูล";
"06 03 67 2A 07"	= "การขยายใบรับรอง";
"06 04 67 2A 07 00"	= "กุญแจหลักแบบแฮช";
"06 04 67 2A 07 01"	= "ประเภทใบรับรอง";
"06 04 67 2A 07 02"	= "ข้อมูลผู้ประกอบการ";
"06 04 67 2A 07 03"	= "บังคับใช้ใบรับรองการ์ด";
"06 04 67 2A 07 04"	= "การทำอุโมงค์";
"06 04 67 2A 07 05"	= "ส่วนขยาย SET";
"06 04 67 2A 07 06"	= "คุณสมบัติเหมาะสม SET";

"06 03 67 2A 08"	= "ตรา";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "ผู้จำหน่าย";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "ความรับผิดชอบ";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "ระดับชาติ";
"06 05 67 2A 0A E2 00"	= "ญี่ปุ่น";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "กุญแจหลักแบบแฮช";
"06 04 86 8D 6F 03"	= "ประเภทใบรับรอง";
"06 04 86 8D 6F 04"	= "ข้อมูลผู้ประกอบการ";
"06 04 86 8D 6F 05"	= "บังคับใช้ใบรับรองการ์ด";
"06 04 86 8D 6F 06"	= "การทำอุโมงค์";
"06 04 86 8D 6F 07"	= "คุณสมบัติเหมาะสม SET";
"06 04 86 8D 6F 63"	= "ข้อมูล SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "ความปลอดภัยข้อมูล Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "ตัวระบุนโยบายความเชื่อถือของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "นโยบาย Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "นโยบายพื้นฐาน X.509 ของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "นโยบาย SSL ของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "นโยบายการสร้างใบรับรองภายในเครื่องของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "นโยบายการสร้าง CSR ภายในเครื่องของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "นโยบายการเพิกถอน CRL ของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "นโยบายการเพิกถอน OCSP ของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "นโยบาย S/MIME ของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "นโยบายการรับรองความถูกต้องแบบขยายได้";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "นโยบายการลงชื่ออัปเดตซอฟต์แวร์ของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "นโยบาย IPsec ของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "นโยบายของ Apple iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "นโยบายการลงชื่อทรัพยากรของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "นโยบายลูกข่าย Apple Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "นโยบายเซิร์ฟเวอร์ Apple Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "นโยบายการลงชื่อรหัสของ Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "นโยบายการลงชื่อแพ็กเกจของ Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "ตัวระบุอัลกอริทึมความปลอดภัย Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "การเข้ารหัส Fast Elliptic (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "การบีบอัดอย่างปลอดภัยของ Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE ด้วยลายเซ็น MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE ด้วยลายเซ็น SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "การเข้ารหัส FEED ของ Apple";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (ทดลอง)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE ด้วยลายเซ็น ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "ตัวระบุใบรับรอง .Mac ของ Apple";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "การขอใบรับรอง .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "การขอใบรับรองประจำตัว .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "การขอลงชื่อใบรับรองอีเมล .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "การขอใบรับรองการเข้ารหัสอีเมล .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "การขอรายการข้อมูลจัดเก็บ .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "การขอเก็บข้อมูลจัดเก็บ .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "การขอเรียกจัดเก็บข้อมูล .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "การขอลบข้อมูลจัดเก็บ .Mac ของ Apple";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "ส่วนขยายใบรับรอง .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "ข้อมูลประจำตัว .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "การลงชื่ออีเมล .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "การเข้ารหัสอีเมล .Mac ของ Apple";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "ค่าการขอใบรับรอง .Mac ของ Apple";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "ชื่อผู้ใช้";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "รหัสผ่าน";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "ชื่อโฮสต์";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "ค่าสถานะต่อเวลา";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "ค่าสถานะเชื่อมแบบต่อเนื่อง";

"06 08 2A 86 48 86 F7 63 64 04" = "การใช้งานกุญแจส่วนขยายของ Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "การลงชื่อรหัสของ Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "การลงชื่อรหัสของ Apple (การพัฒนา)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "การลงชื่ออัปเดตซอฟต์แวร์ Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "การลงชื่อรหัสของ Apple (สงวนไว้)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "การลงชื่อทรัพยากรของ Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "การลงชื่อ iChat ของ Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "การเข้ารหัส iChat ของ Apple";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "ข้อมูลประจำตัวระบบ Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "นโยบายใบรับรองของ Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "นโยบายใบรับรองของ Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "นโยบายใบรับรอง .Mac ของ Apple";

/* Extended key usage */

"06 04 55 1D 25 03"					= "การลงชื่อรหัส";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "ความปลอดภัย CDSA ของ Intel";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "รูปแบบความปลอดภัย CDSA ของ Intel";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "ส่วนขยายใบรับรอง X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "ส่วนขยายใบรับรองส่วนตัว X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "บิตแมปลายเซ็นชื่อเรื่อง";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "รูปภาพของชื่อเรื่อง";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "ที่อยู่อีเมลของชื่อเรื่อง";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "ใช้ข้อยกเว้น";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "อัลกอริทึมความปลอดภัย CDSA ของ Intel";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 ด้วย ECDSA";

/* end */
